## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault_secret.blobstorageclientsecret will be created
  + resource "azurerm_key_vault_secret" "blobstorageclientsecret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv"
      + name                    = "BlobStorage--ClientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.govuknotifyapikey will be created
  + resource "azurerm_key_vault_secret" "govuknotifyapikey" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv"
      + name                    = "GovUkNotify--ApiKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353"
        name     = "s177d01-ntp-pr-353"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>